fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <tabularSections>
    <name>СписокДоговоровИРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_РазмерАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция МассовоеСозданиеДокументаРеализация(Период) Экспорт
	
	ДатаНачала = Период.ДатаНачала;
	МесяцПериода = Месяц(ДатаНачала);
	ДатаДокумента = Период.ДатаОкончания;
	
	Запрос = Новый Запрос;
	
	Запрос.Параметры.Вставить("ПустаяДата",'00010101');
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Клиент,
	|	ДоговорыКонтрагентов.ВКМ_РазмерАбонентскойПлаты КАК СуммаДоговора,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДоговорыАбоненскоеОбслуживание
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Дата КАК ДатаПроведенияРабот,
	|	ВКМ_ВыполненныеКлиентуРаботы.Клиент КАК Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_ОбслуживаниеКлиента
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ_ДоговорыАбоненскоеОбслуживание.СуммаДоговора) КАК СуммаДоговора,
	|	ВТ_ДоговорыАбоненскоеОбслуживание.Организация КАК Организация,
	|	ВТ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	|	ВТ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот) КАК ДатаПроведенияРабот,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот) = ЕСТЬNULL(МЕСЯЦ(РеализацияТоваровУслуг.Дата), &ПустаяДата)
	|			ТОГДА МЕСЯЦ(ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот)
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ КАК МесяцДокументаРеализация
	|ИЗ
	|	ВТ_ОбслуживаниеКлиента КАК ВТ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыАбоненскоеОбслуживание КАК ВТ_ДоговорыАбоненскоеОбслуживание
	|		ПО ВТ_ОбслуживаниеКлиента.Договор = ВТ_ДоговорыАбоненскоеОбслуживание.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_ОбслуживаниеКлиента.Договор = РеализацияТоваровУслуг.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговорыАбоненскоеОбслуживание.Организация,
	|	ВТ_ОбслуживаниеКлиента.Клиент,
	|	ВТ_ОбслуживаниеКлиента.Договор,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот) = ЕСТЬNULL(МЕСЯЦ(РеализацияТоваровУслуг.Дата), &ПустаяДата)
	|			ТОГДА МЕСЯЦ(ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот)
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	СозданныеДокументы = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.МесяцДокументаРеализация = МесяцПериода Тогда
			
			Продолжить; 
			
		ИначеЕсли Выборка.МесяцДокументаРеализация = '00010101' Тогда
			
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументРеализация.Дата = ДатаДокумента; 
			ДокументРеализация.Организация = Выборка.Организация; 
			ДокументРеализация.Контрагент = Выборка.Клиент;
			ДокументРеализация.Договор = Выборка.Договор;
			ДокументРеализация.Ответственный = Пользователи.ТекущийПользователь(); 
			ДокументРеализация.Комментарий = "Созданно автоматически";
			ДокументРеализация.Заполнить(Неопределено);//вызываем стандартный алгоритм заполнения
	       	ДокументРеализация.ВКМ_ВыполнитьАвтозаполнение();
			ДокументРеализация.ПроверитьЗаполнение();//вызываем стандартный алгоритм проверки заполнения 	
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			СозданныеДокументы.Добавить(ДокументРеализация.Ссылка); 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СозданныеДокументы; 
	
КонецФункции

#КонецОбласти

#КонецЕсли
